; domain
(define (domain driverlog)
  (:requirements :typing :fluents) 
  (:types           location locatable - object
		driver truck obj - locatable)

  (:predicates 
		(at ?obj - locatable ?loc - location)
		(in ?obj1 - obj ?obj - truck)
		(driving ?d - driver ?v - truck)
		(link ?x ?y - location) (path ?x ?y - location)
		(empty ?v - truck)
)
  (:functions 	(time-to-walk ?l1 ?l2 - location)
		(time-to-drive ?l1 ?l2 - location)
		(fuel-used)
		(fuel-per-minute ?t - truck)
		(load ?t - truck)
  )


(:action LOAD-TRUCK
  :parameters
   (?obj - obj
    ?truck - truck
    ?loc - location)
  :precondition
   (and (at ?truck ?loc) (at ?obj ?loc))
  :effect
   (and (not (at ?obj ?loc)) (in ?obj ?truck) (increase (load ?truck) 1)
		(increase (fuel-per-minute ?truck) (+ (load ?truck) 1))))

(:action UNLOAD-TRUCK
  :parameters
   (?obj - obj
    ?truck - truck
    ?loc - location)
  :precondition
   (and (at ?truck ?loc) (in ?obj ?truck))
  :effect
   (and (not (in ?obj ?truck)) (at ?obj ?loc) (decrease (load ?truck) 1)
		(decrease (fuel-per-minute ?truck) (load ?truck))))


(:action BOARD-TRUCK
  :parameters
   (?driver - driver
    ?truck - truck
    ?loc - location)
  :precondition
   (and (at ?truck ?loc) (at ?driver ?loc) (empty ?truck))
  :effect
   (and (not (at ?driver ?loc)) (driving ?driver ?truck) (not (empty ?truck))))

(:action DISEMBARK-TRUCK
  :parameters
   (?driver - driver
    ?truck - truck
    ?loc - location)
  :precondition
   (and (at ?truck ?loc) (driving ?driver ?truck))
  :effect
   (and (not (driving ?driver ?truck)) (at ?driver ?loc) (empty ?truck)))

(:action DRIVE-TRUCK
  :parameters
   (?truck - truck
    ?loc-from - location
    ?loc-to - location
    ?driver - driver)
  :precondition
   (and (at ?truck ?loc-from)
   (driving ?driver ?truck) (link ?loc-from ?loc-to))
  :effect
   (and (not (at ?truck ?loc-from)) (at ?truck ?loc-to)
		(increase (fuel-used) (* (fuel-per-minute ?truck) (time-to-drive ?loc-from ?loc-to)))))

(:action WALK
  :parameters
   (?driver - driver
    ?loc-from - location
    ?loc-to - location)
  :precondition
   (and (at ?driver ?loc-from) (path ?loc-from ?loc-to))
  :effect
   (and (not (at ?driver ?loc-from)) (at ?driver ?loc-to)))

 
)

; problem
(define (problem DLOG-3-3-4-236)
	(:domain driverlog)
	(:objects
	driver1 - driver
	driver2 - driver
	driver3 - driver
	truck1 - truck
	truck2 - truck
	truck3 - truck
	package1 - obj
	package2 - obj
	package3 - obj
	package4 - obj
	s0 - location
	s1 - location
	s2 - location
	s3 - location
	s4 - location
	s5 - location
	p2-0 - location
	p2-1 - location
	p2-3 - location
	p4-0 - location
	p4-2 - location
	p4-3 - location
	p4-5 - location
	p1-0 - location
	p5-0 - location
	p5-2 - location
	)
	(:init
	(at driver1 s2)
	(at driver2 s0)
	(at driver3 s4)
	(at truck1 s0)
	(empty truck1)
	(= (load truck1) 0)
	(= (fuel-per-minute truck1) 10)
	(at truck2 s4)
	(empty truck2)
	(= (load truck2) 0)
	(= (fuel-per-minute truck2) 10)
	(at truck3 s5)
	(empty truck3)
	(= (load truck3) 0)
	(= (fuel-per-minute truck3) 10)
	(at package1 s3)
	(at package2 s4)
	(at package3 s5)
	(at package4 s5)
	(path s2 p2-0)
	(path p2-0 s2)
	(path s0 p2-0)
	(path p2-0 s0)
	(= (time-to-walk s2 p2-0) 5)
	(= (time-to-walk p2-0 s2) 5)
	(= (time-to-walk s0 p2-0) 8)
	(= (time-to-walk p2-0 s0) 8)
	(path s2 p2-1)
	(path p2-1 s2)
	(path s1 p2-1)
	(path p2-1 s1)
	(= (time-to-walk s2 p2-1) 2)
	(= (time-to-walk p2-1 s2) 2)
	(= (time-to-walk s1 p2-1) 2)
	(= (time-to-walk p2-1 s1) 2)
	(path s2 p2-3)
	(path p2-3 s2)
	(path s3 p2-3)
	(path p2-3 s3)
	(= (time-to-walk s2 p2-3) 9)
	(= (time-to-walk p2-3 s2) 9)
	(= (time-to-walk s3 p2-3) 1)
	(= (time-to-walk p2-3 s3) 1)
	(path s4 p4-0)
	(path p4-0 s4)
	(path s0 p4-0)
	(path p4-0 s0)
	(= (time-to-walk s4 p4-0) 4)
	(= (time-to-walk p4-0 s4) 4)
	(= (time-to-walk s0 p4-0) 3)
	(= (time-to-walk p4-0 s0) 3)
	(path s4 p4-2)
	(path p4-2 s4)
	(path s2 p4-2)
	(path p4-2 s2)
	(= (time-to-walk s4 p4-2) 10)
	(= (time-to-walk p4-2 s4) 10)
	(= (time-to-walk s2 p4-2) 2)
	(= (time-to-walk p4-2 s2) 2)
	(path s4 p4-3)
	(path p4-3 s4)
	(path s3 p4-3)
	(path p4-3 s3)
	(= (time-to-walk s4 p4-3) 8)
	(= (time-to-walk p4-3 s4) 8)
	(= (time-to-walk s3 p4-3) 6)
	(= (time-to-walk p4-3 s3) 6)
	(path s4 p4-5)
	(path p4-5 s4)
	(path s5 p4-5)
	(path p4-5 s5)
	(= (time-to-walk s4 p4-5) 2)
	(= (time-to-walk p4-5 s4) 2)
	(= (time-to-walk s5 p4-5) 10)
	(= (time-to-walk p4-5 s5) 10)
	(path s1 p1-0)
	(path p1-0 s1)
	(path s0 p1-0)
	(path p1-0 s0)
	(= (time-to-walk s1 p1-0) 2)
	(= (time-to-walk p1-0 s1) 2)
	(= (time-to-walk s0 p1-0) 1)
	(= (time-to-walk p1-0 s0) 1)
	(path s5 p5-0)
	(path p5-0 s5)
	(path s0 p5-0)
	(path p5-0 s0)
	(= (time-to-walk s5 p5-0) 1)
	(= (time-to-walk p5-0 s5) 1)
	(= (time-to-walk s0 p5-0) 9)
	(= (time-to-walk p5-0 s0) 9)
	(path s5 p5-2)
	(path p5-2 s5)
	(path s2 p5-2)
	(path p5-2 s2)
	(= (time-to-walk s5 p5-2) 10)
	(= (time-to-walk p5-2 s5) 10)
	(= (time-to-walk s2 p5-2) 4)
	(= (time-to-walk p5-2 s2) 4)
	(link s4 s0)
	(link s0 s4)
	(= (time-to-drive s4 s0) 2)
	(= (time-to-drive s0 s4) 2)
	(link s4 s2)
	(link s2 s4)
	(= (time-to-drive s4 s2) 10)
	(= (time-to-drive s2 s4) 10)
	(link s4 s5)
	(link s5 s4)
	(= (time-to-drive s4 s5) 9)
	(= (time-to-drive s5 s4) 9)
	(link s0 s3)
	(link s3 s0)
	(= (time-to-drive s0 s3) 3)
	(= (time-to-drive s3 s0) 3)
	(link s1 s0)
	(link s0 s1)
	(= (time-to-drive s1 s0) 4)
	(= (time-to-drive s0 s1) 4)
	(link s2 s1)
	(link s1 s2)
	(= (time-to-drive s2 s1) 10)
	(= (time-to-drive s1 s2) 10)
	(link s5 s1)
	(link s1 s5)
	(= (time-to-drive s5 s1) 4)
	(= (time-to-drive s1 s5) 4)
	(link s5 s2)
	(link s2 s5)
	(= (time-to-drive s5 s2) 3)
	(= (time-to-drive s2 s5) 3)
	(link s3 s4)
	(link s4 s3)
	(= (time-to-drive s3 s4) 2)
	(= (time-to-drive s4 s3) 2)
	(= (fuel-used) 0)
)
	(:goal (and
	(at driver1 s0)
	(at truck1 s0)
	(at truck3 s3)
	(at package1 s3)
	(at package2 s2)
	(at package3 s1)
	(at package4 s0)
	))

(:metric minimize (+ (* 4 (total-time)) (* 2 (fuel-used))))

)

; plan
1. (board-truck driver3 truck2 s4)
   deleted: (at driver3 s4) (empty truck2)
   added: (driving driver3 truck2)
   goals met: 2 of 7
2. (load-truck package2 truck2 s4)
   deleted: (at package2 s4)
   added: (in package2 truck2)
   changed: (load truck2) from 0 to 1, (fuel-per-minute truck2) from 10 to 11
   goals met: 2 of 7
3. (drive-truck truck2 s4 s5 driver3)
   deleted: (at truck2 s4)
   added: (at truck2 s5)
   changed: (fuel-used) from 0 to 99
   goals met: 2 of 7
4. (load-truck package3 truck2 s5)
   deleted: (at package3 s5)
   added: (in package3 truck2)
   changed: (load truck2) from 1 to 2, (fuel-per-minute truck2) from 11 to 13
   goals met: 2 of 7
5. (disembark-truck driver3 truck2 s5)
   deleted: (driving driver3 truck2)
   added: (at driver3 s5) (empty truck2)
   goals met: 2 of 7
6. (load-truck package4 truck3 s5)
   deleted: (at package4 s5)
   added: (in package4 truck3)
   changed: (load truck3) from 0 to 1, (fuel-per-minute truck3) from 10 to 11
   goals met: 2 of 7
7. (walk driver1 s2 p2-0)
   deleted: (at driver1 s2)
   added: (at driver1 p2-0)
   goals met: 2 of 7
8. (walk driver1 p2-0 s0)
   deleted: (at driver1 p2-0)
   added: (at driver1 s0)
   goals met: 3 of 7
9. (board-truck driver3 truck3 s5)
   deleted: (at driver3 s5) (empty truck3)
   added: (driving driver3 truck3)
   goals met: 3 of 7
10. (drive-truck truck3 s5 s1 driver3)
   deleted: (at truck3 s5)
   added: (at truck3 s1)
   changed: (fuel-used) from 99 to 143
   goals met: 3 of 7
11. (unload-truck package2 truck2 s5)
   deleted: (in package2 truck2)
   added: (at package2 s5)
   changed: (load truck2) from 2 to 1, (fuel-per-minute truck2) from 13 to 11
   goals met: 3 of 7
12. (unload-truck package3 truck2 s5)
   deleted: (in package3 truck2)
   added: (at package3 s5)
   changed: (load truck2) from 1 to 0, (fuel-per-minute truck2) from 11 to 10
   goals met: 3 of 7
13. (drive-truck truck3 s1 s0 driver3)
   deleted: (at truck3 s1)
   added: (at truck3 s0)
   changed: (fuel-used) from 143 to 187
   goals met: 3 of 7
14. (unload-truck package4 truck3 s0)
   deleted: (in package4 truck3)
   added: (at package4 s0)
   changed: (load truck3) from 1 to 0, (fuel-per-minute truck3) from 11 to 10
   goals met: 4 of 7
15. (drive-truck truck3 s0 s1 driver3)
   deleted: (at truck3 s0)
   added: (at truck3 s1)
   changed: (fuel-used) from 187 to 227
   goals met: 4 of 7
16. (drive-truck truck3 s1 s5 driver3)
   deleted: (at truck3 s1)
   added: (at truck3 s5)
   changed: (fuel-used) from 227 to 267
   goals met: 4 of 7
17. (load-truck package2 truck3 s5)
   deleted: (at package2 s5)
   added: (in package2 truck3)
   changed: (load truck3) from 0 to 1, (fuel-per-minute truck3) from 10 to 11
   goals met: 4 of 7
18. (load-truck package3 truck3 s5)
   deleted: (at package3 s5)
   added: (in package3 truck3)
   changed: (load truck3) from 1 to 2, (fuel-per-minute truck3) from 11 to 13
   goals met: 4 of 7
19. (drive-truck truck3 s5 s2 driver3)
   deleted: (at truck3 s5)
   added: (at truck3 s2)
   changed: (fuel-used) from 267 to 306
   goals met: 4 of 7
20. (unload-truck package2 truck3 s2)
   deleted: (in package2 truck3)
   added: (at package2 s2)
   changed: (load truck3) from 2 to 1, (fuel-per-minute truck3) from 13 to 11
   goals met: 5 of 7
21. (drive-truck truck3 s2 s1 driver3)
   deleted: (at truck3 s2)
   added: (at truck3 s1)
   changed: (fuel-used) from 306 to 416
   goals met: 5 of 7
22. (unload-truck package3 truck3 s1)
   deleted: (in package3 truck3)
   added: (at package3 s1)
   changed: (load truck3) from 1 to 0, (fuel-per-minute truck3) from 11 to 10
   goals met: 6 of 7
23. (drive-truck truck3 s1 s0 driver3)
   deleted: (at truck3 s1)
   added: (at truck3 s0)
   changed: (fuel-used) from 416 to 456
   goals met: 6 of 7
24. (drive-truck truck3 s0 s3 driver3)
   deleted: (at truck3 s0)
   added: (at truck3 s3)
   changed: (fuel-used) from 456 to 486
   goals met: 7 of 7
